In [1]:
# Do all imports and installs here - Done
from pyspark.sql import SparkSession
from pyspark.sql.functions import udf
import pandas as pd
import re
import configparser
import os
from pathlib import Path

In [2]:
# Parse configurations - Done
config = configparser.ConfigParser()
config.read('etl.cfg')

['etl.cfg']

In [3]:
# Run on production version
spark = SparkSession.builder\
            .config("spark.jars.repositories", "https://repos.spark-packages.org/")\
            .config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11")\
            .enableHiveSupport()\
            .getOrCreate()

In [4]:
def rmdir(directory):
    '''
    This procedure perform pure recursive a directory.
    
    Parameters
    ----------
    directory : string_of_path_to_dir
        The input directory is a path to target dir. This dir and all its belong child objects wil be deleted.
        Syntax note: rmdir(Path("target_path_to_dir"))
            with Path("target_path_to_dir") returns path to dir format as 'directory' input
    
    Returns
    -------
    None
    '''
    directory = Path(directory)
    for item in directory.iterdir():
        if item.is_dir():
            rmdir(item)
        else:
            item.unlink()
    directory.rmdir()

In [5]:
def convert_column_names(df):
    '''
    This procedure standardizing column names to snake case format. Format ex: customer_name, billing_address, total_price.
    
    Parameters
    ----------
    dataframe : string_of_dataframe
        The input dataframe with column names might have elements of messy columns names, including accents, different delimiters, casing and multiple white spaces.
        Snake case style replaces the white spaces and symbol delimiters with underscore and converts all characters to lower case
    
    Returns
    -------
    Dataframe with column names has been changed to snake_case format.
    '''
    cols = df.columns
    column_name_changed = []

    for col in cols:
        new_column = col.lstrip().rstrip().lower().replace (" ", "_").replace ("-", "_")
        column_name_changed.append(new_column)

    df.columns = column_name_changed

In [6]:
input_data_source = config.get('DIR','INPUT_DIR')
output_processed_data = config.get('DIR','OUTPUT_DIR')

i94immi_dataset = config.get('DATA','I94_IMMI')
worldtempe_dataset = config.get('DATA','WORLD_TEMPE')
citydemo_dataset = config.get('DATA','CITY_DEMOGRAPHIC')
airport_dataset = config.get('DATA','AIR_PORT')
saslabel_dataset = config.get('DATA','SAS_LABEL')

In [7]:
worldtempe_dataset

'../../data2/GlobalLandTemperaturesByCity.csv'

In [18]:
# For production only
# worldtempe_dataset = '../../data2/GlobalLandTemperaturesByCity.csv'

worldtempe_dataset = 'GlobalLandTemperaturesByCity_part9.csv'
worldtempe_df = pd.read_csv(worldtempe_dataset,sep=",", index_col=False)
worldtempe_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             100000 non-null  object
 1   AverageTemperature             96552 non-null   float64
 2   AverageTemperatureUncertainty  96552 non-null   float64
 3   City                           100000 non-null  object
 4   Country                        100000 non-null  object
 5   Latitude                       100000 non-null  object
 6   Longitude                      100000 non-null  object
dtypes: float64(2), object(5)
memory usage: 5.3+ MB

In [8]:
worldtempe_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1748-09-01,NaN,NaN,Belgorod,Russia,50.63N,36.76E
1,1748-10-01,NaN,NaN,Belgorod,Russia,50.63N,36.76E
2,1748-11-01,NaN,NaN,Belgorod,Russia,50.63N,36.76E
3,1748-12-01,NaN,NaN,Belgorod,Russia,50.63N,36.76E
4,1749-01-01,NaN,NaN,Belgorod,Russia,50.63N,36.76E

In [22]:
pd.Timestamp(worldtempe_df.dt)

TypeError: Cannot convert input [0        1748-09-01
1        1748-10-01
2        1748-11-01
3        1748-12-01
4        1749-01-01
            ...
99995    1815-11-01
99996    1815-12-01
99997    1816-01-01
99998    1816-02-01
99999    1816-03-01
Name: dt, Length: 100000, dtype: object] of type <class 'pandas.core.series.Series'> to Timestamp

In [16]:
worldtempe_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 8 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             100000 non-null  object
 1   AverageTemperature             96552 non-null   float64
 2   AverageTemperatureUncertainty  96552 non-null   float64
 3   City                           100000 non-null  object
 4   Country                        100000 non-null  object
 5   Latitude                       100000 non-null  object
 6   Longitude                      100000 non-null  object
 7   dt_converted                   100000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(5)
memory usage: 6.1+ MB

In [21]:
worldtempe_df['dt_timestamp'] = pd.Timestamp(worldtempe_df.dt)

TypeError: Cannot convert input [0        1748-09-01
1        1748-10-01
2        1748-11-01
3        1748-12-01
4        1749-01-01
            ...
99995    1815-11-01
99996    1815-12-01
99997    1816-01-01
99998    1816-02-01
99999    1816-03-01
Name: dt, Length: 100000, dtype: object] of type <class 'pandas.core.series.Series'> to Timestamp

In [10]:
worldtempe_df['Country'].value_counts().sort_values()

Papua New Guinea               1581
Oman                           1653
Djibouti                       1797
Eritrea                        1797
Swaziland                      1881
Namibia                        1881
Botswana                       1881
Lesotho                        1881
Congo                          1893
Central African Republic       1893
Costa Rica                     1953
Burundi                        1965
Rwanda                         1965
Liberia                        1977
Guinea Bissau                  1977
Mauritania                     1977
Bahrain                        2049
Qatar                          2049
Hong Kong                      2082
South Korea                    2097
Singapore                      2265
Cambodia                       2265
Guyana                         2277
Suriname                       2277
Mongolia                       2318
Laos                           2371
Azerbaijan                     2460
Jordan                         2460
Cyprus                         2669
Mauritius                      2721
                             ...
Taiwan                        62190
Argentina                     62504
Vietnam                       66330
Malaysia                      72480
Canada                        75445
Netherlands                   77736
Ukraine                       77736
Romania                       80975
Colombia                      88017
Venezuela                     91080
South Africa                  94050
France                       116604
Poland                       123082
Philippines                  127700
Italy                        136038
Pakistan                     139231
Turkey                       150306
Iran                         151651
Spain                        159594
Nigeria                      172347
Mexico                       209560
United Kingdom               220252
Germany                      262359
Indonesia                    323255
Japan                        358669
Russia                       461234
Brazil                       475580
United States                687289
China                        827802
India                       1014906
Name: Country, Length: 159, dtype: int64

In [12]:
worldtempe_df.shape

(8599212, 7)

### Cleaning Country

Filter out `Country` for single value `United States` and check dataframe size

In [13]:
worldtempe_df = worldtempe_df[worldtempe_df['Country']=='United States']

In [14]:
worldtempe_df['Country'].value_counts().sort_values()

United States    687289
Name: Country, dtype: int64

In [15]:
worldtempe_df.shape

(687289, 7)

### Cleaning columns with datetime datetype

In [16]:
worldtempe_df['dt_converted'] = pd.to_datetime(worldtempe_df.dt)

In [17]:
worldtempe_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 687289 entries, 47555 to 8439246
Data columns (total 8 columns):
dt                               687289 non-null object
AverageTemperature               661524 non-null float64
AverageTemperatureUncertainty    661524 non-null float64
City                             687289 non-null object
Country                          687289 non-null object
Latitude                         687289 non-null object
Longitude                        687289 non-null object
dt_converted                     687289 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(5)
memory usage: 47.2+ MB

In [19]:
worldtempe_df=worldtempe_df[worldtempe_df['dt_converted']>"1960-01-01"]

In [20]:
worldtempe_df.shape

(165508, 8)

In [21]:
worldtempe_df['dt_converted'].max()

Timestamp('2013-09-01 00:00:00')

In [22]:
worldtempe_df['dt_converted'].min()

Timestamp('1960-02-01 00:00:00')

In [23]:
worldtempe_df.isnull().sum()

dt                               0
AverageTemperature               1
AverageTemperatureUncertainty    1
City                             0
Country                          0
Latitude                         0
Longitude                        0
dt_converted                     0
dtype: int64

In [29]:
worldtempe_df[worldtempe_df['AverageTemperature'].isnull()]

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
287781,2013-09-01,NaN,NaN,Anchorage,United States,61.88N,151.13W,2013-09-01

*NULL* value doen't impact to join data ***i94 immigration*** on year 2016 only. Keep it as is.

### Cleaning combination `City` and `dt_converted`

In [31]:
worldtempe_df.nunique()

dt                                 644
AverageTemperature               34110
AverageTemperatureUncertainty      985
City                               248
Country                              1
Latitude                            15
Longitude                           95
dt_converted                       644
dtype: int64

In [37]:
worldtempe_df["City"] = worldtempe_df["City"].str.upper()

In [38]:
worldtempe_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
49236,1960-02-01,4.995,0.325,ABILENE,United States,32.95N,100.53W,1960-02-01
49237,1960-03-01,8.575,0.303,ABILENE,United States,32.95N,100.53W,1960-03-01
49238,1960-04-01,18.452,0.282,ABILENE,United States,32.95N,100.53W,1960-04-01
49239,1960-05-01,21.709,0.286,ABILENE,United States,32.95N,100.53W,1960-05-01
49240,1960-06-01,27.714,0.387,ABILENE,United States,32.95N,100.53W,1960-06-01

In [49]:
worldtempe_df[worldtempe_df[['City','AverageTemperature']].duplicated()]

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
49499,1982-01-01,5.807,0.429,ABILENE,United States,32.95N,100.53W,1982-01-01
49552,1986-06-01,25.614,0.162,ABILENE,United States,32.95N,100.53W,1986-06-01
49641,1993-11-01,8.751,0.260,ABILENE,United States,32.95N,100.53W,1993-11-01
49678,1996-12-01,8.166,0.227,ABILENE,United States,32.95N,100.53W,1996-12-01
140079,1994-12-01,2.173,0.289,AKRON,United States,40.99N,80.95W,1994-12-01
140172,2002-09-01,20.116,0.122,AKRON,United States,40.99N,80.95W,2002-09-01
140273,2011-02-01,-1.359,0.274,AKRON,United States,40.99N,80.95W,2011-02-01
140274,2011-03-01,2.899,0.238,AKRON,United States,40.99N,80.95W,2011-03-01
170072,1986-06-01,20.277,0.342,ALBUQUERQUE,United States,34.56N,107.03W,1986-06-01
170094,1988-04-01,10.597,0.209,ALBUQUERQUE,United States,34.56N,107.03W,1988-04-01
170178,1995-04-01,9.407,0.231,ALBUQUERQUE,United States,34.56N,107.03W,1995-04-01
170344,2009-02-01,4.307,0.338,ALBUQUERQUE,United States,34.56N,107.03W,2009-02-01
170350,2009-08-01,22.303,0.400,ALBUQUERQUE,United States,34.56N,107.03W,2009-08-01
170353,2009-11-01,5.515,0.313,ALBUQUERQUE,United States,34.56N,107.03W,2009-11-01
190199,1966-06-01,22.431,0.190,ALEXANDRIA,United States,39.38N,76.99W,1966-06-01
190228,1968-11-01,7.943,0.107,ALEXANDRIA,United States,39.38N,76.99W,1968-11-01
190357,1979-08-01,23.344,0.327,ALEXANDRIA,United States,39.38N,76.99W,1979-08-01
190414,1984-05-01,16.622,0.200,ALEXANDRIA,United States,39.38N,76.99W,1984-05-01
190497,1991-04-01,12.929,0.205,ALEXANDRIA,United States,39.38N,76.99W,1991-04-01
190516,1992-11-01,7.429,0.211,ALEXANDRIA,United States,39.38N,76.99W,1992-11-01
190545,1995-04-01,11.465,0.307,ALEXANDRIA,United States,39.38N,76.99W,1995-04-01
190611,2000-10-01,13.848,0.356,ALEXANDRIA,United States,39.38N,76.99W,2000-10-01
190681,2006-08-01,25.315,0.250,ALEXANDRIA,United States,39.38N,76.99W,2006-08-01
190710,2009-01-01,-2.133,0.228,ALEXANDRIA,United States,39.38N,76.99W,2009-01-01
205303,1998-03-01,5.169,0.147,ALLENTOWN,United States,40.99N,74.56W,1998-03-01
205318,1999-06-01,21.254,0.196,ALLENTOWN,United States,40.99N,74.56W,1999-06-01
205440,2009-08-01,22.769,0.277,ALLENTOWN,United States,40.99N,74.56W,2009-08-01
205479,2012-11-01,4.103,0.298,ALLENTOWN,United States,40.99N,74.56W,2012-11-01
233540,1973-03-01,9.993,0.343,AMARILLO,United States,34.56N,101.19W,1973-03-01
233594,1977-09-01,24.375,0.448,AMARILLO,United States,34.56N,101.19W,1977-09-01
...,...,...,...,...,...,...,...,...
8223759,1990-03-01,3.378,0.280,WINDSOR,United States,42.59N,82.91W,1990-03-01
8223810,1994-06-01,20.544,0.293,WINDSOR,United States,42.59N,82.91W,1994-06-01
8223812,1994-08-01,19.993,0.280,WINDSOR,United States,42.59N,82.91W,1994-08-01
8223886,2000-10-01,12.261,0.324,WINDSOR,United States,42.59N,82.91W,2000-10-01
8223911,2002-11-01,3.504,0.162,WINDSOR,United States,42.59N,82.91W,2002-11-01
8223983,2008-11-01,3.707,0.229,WINDSOR,United States,42.59N,82.91W,2008-11-01
8224031,2012-11-01,3.800,0.222,WINDSOR,United States,42.59N,82.91W,2012-11-01
8229698,1970-02-01,4.411,0.146,WINSTON SALEM,United States,36.17N,79.56W,1970-02-01
8229746,1974-02-01,5.547,0.226,WINSTON SALEM,United States,36.17N,79.56W,1974-02-01
8229804,1978-12-01,5.547,0.421,WINSTON SALEM,United States,36.17N,79.56W,1978-12-01
8229842,1982-02-01,6.214,0.298,WINSTON SALEM,United States,36.17N,79.56W,1982-02-01
8229956,1991-08-01,24.843,0.306,WINSTON SALEM,United States,36.17N,79.56W,1991-08-01
8229974,1993-02-01,3.955,0.236,WINSTON SALEM,United States,36.17N,79.56W,1993-02-01
8230016,1996-08-01,24.086,0.213,WINSTON SALEM,United States,36.17N,79.56W,1996-08-01
8230066,2000-10-01,15.557,0.243,WINSTON SALEM,United States,36.17N,79.56W,2000-10-01
8230071,2001-03-01,8.166,0.348,WINSTON SALEM,United States,36.17N,79.56W,2001-03-01
8230173,2009-09-01,20.964,0.182,WINSTON SALEM,United States,36.17N,79.56W,2009-09-01
8230218,2013-06-01,24.032,0.296,WINSTON SALEM,United States,36.17N,79.56W,2013-06-01
8255175,1987-06-01,18.530,0.330,WORCESTER,United States,42.59N,72.00W,1987-06-01
8255212,1990-07-01,21.379,0.423,WORCESTER,United States,42.59N,72.00W,1990-07-01
8255273,1995-08-01,20.228,0.487,WORCESTER,United States,42.59N,72.00W,1995-08-01
8255296,1997-07-01,20.729,0.452,WORCESTER,United States,42.59N,72.00W,1997-07-01
8255344,2001-07-01,19.568,0.262,WORCESTER,United States,42.59N,72.00W,2001-07-01
8255373,2003-12-01,-1.849,0.347,WORCESTER,United States,42.59N,72.00W,2003-12-01
8255406,2006-09-01,15.376,0.181,WORCESTER,United States,42.59N,72.00W,2006-09-01
8255482,2013-01-01,-4.140,0.355,WORCESTER,United States,42.59N,72.00W,2013-01-01
8439060,1998-03-01,5.169,0.147,YONKERS,United States,40.99N,74.56W,1998-03-01
8439075,1999-06-01,21.254,0.196,YONKERS,United States,40.99N,74.56W,1999-06-01
8439197,2009-08-01,22.769,0.277,YONKERS,United States,40.99N,74.56W,2009-08-01
8439236,2012-11-01,4.103,0.298,YONKERS,United States,40.99N,74.56W,2012-11-01

In [55]:
worldtempe_df[worldtempe_df[['City','dt_converted']].duplicated()].tail()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
7148658,2013-05-01,14.309,0.331,SPRINGFIELD,United States,42.59N,72.00W,2013-05-01
7148659,2013-06-01,19.313,0.353,SPRINGFIELD,United States,42.59N,72.00W,2013-06-01
7148660,2013-07-01,23.629,0.447,SPRINGFIELD,United States,42.59N,72.00W,2013-07-01
7148661,2013-08-01,19.579,0.336,SPRINGFIELD,United States,42.59N,72.00W,2013-08-01
7148662,2013-09-01,15.883,1.368,SPRINGFIELD,United States,42.59N,72.00W,2013-09-01

In [48]:
worldtempe_df[(worldtempe_df['City'] == 'SPRINGFIELD') & (worldtempe_df.dt == '2013-08-01')]

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
7142183,2013-08-01,24.568,0.303,SPRINGFIELD,United States,37.78N,93.56W,2013-08-01
7145422,2013-08-01,23.645,0.378,SPRINGFIELD,United States,39.38N,89.48W,2013-08-01
7148661,2013-08-01,19.579,0.336,SPRINGFIELD,United States,42.59N,72.00W,2013-08-01

In [54]:
worldtempe_df[(worldtempe_df['City'] == 'YONKERS') & (worldtempe_df.dt == '2013-08-01')]

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
8439245,2013-08-01,21.001,0.323,YONKERS,United States,40.99N,74.56W,2013-08-01

In [53]:
worldtempe_df[(worldtempe_df['City'] == 'WINSTON SALEM') & (worldtempe_df.dt == '1970-02-01')]

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
8229698,1970-02-01,4.411,0.146,WINSTON SALEM,United States,36.17N,79.56W,1970-02-01

Seem like there are multi temperature sensor was distributed many points of a city. The temperature results of a city are difference not much.

In [42]:
worldtempe_df[worldtempe_df[['City','dt_converted','AverageTemperature']].duplicated()].tail()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,dt_converted
487934,1986-11-01,2.766,0.194,AURORA,United States,40.99N,87.34W,1986-11-01
7144796,1961-06-01,21.821,0.404,SPRINGFIELD,United States,39.38N,89.48W,1961-06-01

Unique values should be the combination of `'City','dt_converted','AverageTemperature'`

### Standalizing column names format

Convert column names to ***snake_case*** format. Format ex: *customer_name, billing_address, ...*

In [56]:
convert_column_names(worldtempe_df)
worldtempe_df.columns

Index(['dt', 'averagetemperature', 'averagetemperatureuncertainty', 'city',
       'country', 'latitude', 'longitude', 'dt_converted'],
      dtype='object')

In [57]:
staging_cols = ['dt', 'averagetemperature', 'averagetemperatureuncertainty', 'city', 'dt_converted','country']
worldtempe_df = worldtempe_df[staging_cols]
worldtempe_df.columns

Index(['dt', 'averagetemperature', 'averagetemperatureuncertainty', 'city',
       'dt_converted', 'country'],
      dtype='object')

In [58]:
worldtempe_df.head()

,dt,averagetemperature,averagetemperatureuncertainty,city,dt_converted,country
49236,1960-02-01,4.995,0.325,ABILENE,1960-02-01,United States
49237,1960-03-01,8.575,0.303,ABILENE,1960-03-01,United States
49238,1960-04-01,18.452,0.282,ABILENE,1960-04-01,United States
49239,1960-05-01,21.709,0.286,ABILENE,1960-05-01,United States
49240,1960-06-01,27.714,0.387,ABILENE,1960-06-01,United States

In [59]:
worldtempe_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165508 entries, 49236 to 8439246
Data columns (total 6 columns):
dt                               165508 non-null object
averagetemperature               165507 non-null float64
averagetemperatureuncertainty    165507 non-null float64
city                             165508 non-null object
dt_converted                     165508 non-null datetime64[ns]
country                          165508 non-null object
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 8.8+ MB

### Baseline dataframe World Teperature

In [60]:
worldtempe_df.to_csv('worldtempe_df_clean.csv', index=False, header=True)

In [62]:
# Verify
worldtempe_df = pd.read_csv('worldtempe_df_clean.csv',sep=",")
worldtempe_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165508 entries, 0 to 165507
Data columns (total 6 columns):
dt                               165508 non-null object
averagetemperature               165507 non-null float64
averagetemperatureuncertainty    165507 non-null float64
city                             165508 non-null object
dt_converted                     165508 non-null object
country                          165508 non-null object
dtypes: float64(2), object(4)
memory usage: 7.6+ MB

In [63]:
worldtempe_df.head()

,dt,averagetemperature,averagetemperatureuncertainty,city,dt_converted,country
0,1960-02-01,4.995,0.325,ABILENE,1960-02-01,United States
1,1960-03-01,8.575,0.303,ABILENE,1960-03-01,United States
2,1960-04-01,18.452,0.282,ABILENE,1960-04-01,United States
3,1960-05-01,21.709,0.286,ABILENE,1960-05-01,United States
4,1960-06-01,27.714,0.387,ABILENE,1960-06-01,United States

===========================================================================================================
    
===========================================================================================================

### Staging cleaned `WORLD TEMPERATURE` from saved csv partitions

In [ ]:
# clear old dir
rmdir(Path("worldtempe_df_clean"))

In [65]:
worldtempe_df = spark.read.csv("worldtempe_df_clean.csv", header=True)

In [ ]:
# Write dataframe to CSV partitions use Spark
# worldtempe_df.write.options(header="True", delimiter=",").csv("worldtempe_df_clean")
# worldtempe_df.write.mode('overwrite').csv("worldtempe_df_clean")
# worldtempe_df.write.options(header="True", delimiter=",").csv("worldtempe_df_clean")

# Read out from CSV file to spark dataframe
# worldtempe_df = spark.read.csv("worldtempe_df_clean.csv")
# worldtempe_df = spark.read.options(inferSchema="true", delimiter=",", header = "true").csv("worldtempe_df_clean")

In [66]:
# Verify loaded dataframe
worldtempe_df.show()

+----------+------------------+-----------------------------+-------+------------+-------------+
|        dt|averagetemperature|averagetemperatureuncertainty|   city|dt_converted|      country|
+----------+------------------+-----------------------------+-------+------------+-------------+
|1960-02-01|             4.995|                        0.325|ABILENE|  1960-02-01|United States|
|1960-03-01| 8.575000000000001|                        0.303|ABILENE|  1960-03-01|United States|
|1960-04-01|            18.452|                        0.282|ABILENE|  1960-04-01|United States|
|1960-05-01|            21.709|          0.28600000000000003|ABILENE|  1960-05-01|United States|
|1960-06-01|            27.714|                        0.387|ABILENE|  1960-06-01|United States|
|1960-07-01|            27.646|                        0.326|ABILENE|  1960-07-01|United States|
|1960-08-01|            27.481|                        0.341|ABILENE|  1960-08-01|United States|
|1960-09-01|            24.413|                        0.241|ABILENE|  1960-09-01|United States|
|1960-10-01|18.929000000000002|          0.28600000000000003|ABILENE|  1960-10-01|United States|
|1960-11-01|            12.531|                        0.235|ABILENE|  1960-11-01|United States|
|1960-12-01|             4.114|                        0.214|ABILENE|  1960-12-01|United States|
|1961-01-01|             3.827|                        0.337|ABILENE|  1961-01-01|United States|
|1961-02-01|              7.63|                        0.349|ABILENE|  1961-02-01|United States|
|1961-03-01|12.799000000000001|                        0.329|ABILENE|  1961-03-01|United States|
|1961-04-01|            17.142|                        0.397|ABILENE|  1961-04-01|United States|
|1961-05-01|            22.582|                        0.254|ABILENE|  1961-05-01|United States|
|1961-06-01|             24.53|                        0.333|ABILENE|  1961-06-01|United States|
|1961-07-01|            25.783|                         0.24|ABILENE|  1961-07-01|United States|
|1961-08-01|26.052000000000003|                        0.205|ABILENE|  1961-08-01|United States|
|1961-09-01|22.875999999999998|                        0.391|ABILENE|  1961-09-01|United States|
+----------+------------------+-----------------------------+-------+------------+-------------+
only showing top 20 rows

In [67]:
# Create table from dataframe
worldtempe_df.createOrReplaceTempView('worldtempe_table')

In [68]:
# Verify created table will be using for staging
spark.sql("""
    SELECT COUNT(*) as amount_worldtempe_rows
    FROM worldtempe_table
""").show()

+----------------------+
|amount_worldtempe_rows|
+----------------------+
|                165508|
+----------------------+